{
  "vocab_size": 174,
  "char_to_id": {
    "\u0080": 0,
    "\u0081": 1,
    "\u00c2": 63,
    "\u0082": 2,
    "\u0083": 3,
    "\u0084": 4,
    "\u0085": 5,
    "\u0086": 6,
    "\u0087": 7,
    "\u0088": 8,
    "\u0089": 9,
    "\u008a": 10,
    "\u008b": 11,
    "\u008c": 12,
    "\u008d": 13,
    "\u008e": 14,
    "\u008f": 15,
    "\u0090": 16,
    "\u0091": 17,
    "\u0092": 18,
    "\u0093": 19,
    "\u0094": 20,
    "\u0095": 21,
    "\u0096": 22,
    "\u0097": 23,
    "\u0098": 24,
    "\u0099": 25,
    "\u009a": 26,
    "\u009b": 27,
    "\u009c": 28,
    "\u009d": 29,
    "\u009e": 30,
    "\u009f": 31,
    "\u00a0": 32,
    "\u00a1": 33,
    "\u00a2": 34,
    "\u00a3": 35,
    "\u00a4": 36,
    "\u00a5": 37,
    "\u00a6": 38,
    "\u00a7": 39,
    "\u00a8": 40,
    "\u00a9": 41,
    "\u00aa": 42,
    "\u00ab": 43,
    "\u00ad": 44,
    "\u00ae": 45,
    "\u00af": 46,
    "\u00b0": 47,
    "\u00b1": 48,
    "\u00b2": 49,
    "\u00b3": 50,
    "\u00b4": 51,
    "\u00b5": 52,
    "\u00b6": 53,
    "\u00b7": 54,
    "\u00b8": 55,
    "\u00b9": 56,
    "\u00ba": 57,
    "\u00bb": 58,
    "\u00bc": 59,
    "\u00bd": 60,
    "\u00be": 61,
    "\u00bf": 62,
    "\u00c3": 64,
    "\u00c4": 65,
    "\u00c5": 66,
    "\u00ce": 67,
    "\u00cf": 68,
    "\u00d0": 69,
    "\u00d1": 70,
    "\u00e0": 71,
    "\u00e1": 72,
    "\u00e2": 73,
    "\u00e3": 74,
    "\u00ef": 75,
    "\u00f0": 76,
    "\n": 77,
    "\r": 78,
    " ": 79,
    "!": 80,
    "\"": 81,
    "#": 82,
    "$": 83,
    "%": 84,
    "&": 85,
    "'": 86,
    "(": 87,
    ")": 88,
    "*": 89,
    "+": 90,
    ",": 91,
    "-": 92,
    ".": 93,
    "/": 94,
    "0": 95,
    "1": 96,
    "2": 97,
    "3": 98,
    "4": 99,
    "5": 100,
    "6": 101,
    "7": 102,
    "8": 103,
    "9": 104,
    ":": 105,
    ";": 106,
    "<": 107,
    "=": 108,
    ">": 109,
    "?": 110,
    "@": 111,
    "A": 112,
    "B": 113,
    "C": 114,
    "D": 115,
    "E": 116,
    "F": 117,
    "G": 118,
    "H": 119,
    "I": 120,
    "J": 121,
    "K": 122,
    "L": 123,
    "M": 124,
    "N": 125,
    "O": 126,
    "P": 127,
    "Q": 128,
    "R": 129,
    "S": 130,
    "T": 131,
    "U": 132,
    "V": 133,
    "W": 134,
    "X": 135,
    "Y": 136,
    "Z": 137,
    "[": 138,
    "\\": 139,
    "]": 140,
    "^": 141,
    "_": 142,
    "`": 143,
    "a": 144,
    "b": 145,
    "c": 146,
    "d": 147,
    "e": 148,
    "f": 149,
    "g": 150,
    "h": 151,
    "i": 152,
    "j": 153,
    "k": 154,
    "l": 155,
    "m": 156,
    "n": 157,
    "o": 158,
    "p": 159,
    "q": 160,
    "r": 161,
    "s": 162,
    "t": 163,
    "u": 164,
    "v": 165,
    "w": 166,
    "x": 167,
    "y": 168,
    "z": 169,
    "{": 170,
    "|": 171,
    "}": 172,
    "~": 173
  }
}
